{
  "catalog": {
    "uuid": "d186e90d-ecbd-4d07-8311-4603deb60225",
    "metadata": {
      "title": "Gesamtkatalog BSI Grundschutz Kompendium 2023",
      "last-modified": "2025-06-27T17:42:20.097143+00:00",
      "version": "1.0.0",
      "oscal-version": "1.1.2"
    },
    "groups": [
      {
        "id": "ISMS",
        "title": "ISMS: Sicherheitsmanagement",
        "class": "main-group",
        "groups": [
          {
            "id": "ISMS.1",
            "title": "Sicherheitsmanagement",
            "class": "baustein",
            "controls": [
              {
                "id": "ISMS.1.A1",
                "title": "Übernahme der Gesamtverantwortung für Informationssicherheit durch die Leitung (B)",
                "class": "Management",
                "props": [
                  {
                    "name": "level",
                    "value": "1",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "phase",
                    "value": "Initiation",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "practice",
                    "value": "GOV",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_c",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_i",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_a",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  }
                ],
                "parts": [
                  {
                    "id": "isms.1.a1-m1",
                    "name": "maturity-level-description",
                    "title": "Maturity Level 1: Partial",
                    "class": "maturity-level-partial",
                    "parts": [
                      {
                        "name": "statement",
                        "prose": "Die Institutionsleitung hat die Verantwortung für Informationssicherheit nur mündlich oder informell anerkannt. Die Übernahme der Verantwortung ist nicht dokumentiert und wird nicht aktiv kommuniziert, was zu Unklarheiten bei den Mitarbeitenden führt."
                      },
                      {
                        "name": "guidance",
                        "prose": "In dieser Stufe wird die Verantwortung oft nur reaktiv im Falle eines Sicherheitsvorfalls oder einer externen Prüfung erwähnt. Es gibt keine formalen Dokumente wie eine Ernennungsurkunde für den ISB oder eine offizielle Leitlinie."
                      },
                      {
                        "name": "assessment-method",
                        "prose": "Der Prüfer befragt Führungskräfte und stellt fest, ob sie ihre Verantwortung für die Informationssicherheit verstehen und wahrnehmen. Es wird geprüft, ob eine formale Zuweisung der Gesamtverantwortung fehlt."
                      }
                    ]
                  },
                  {
                    "id": "isms.1.a1-m2",
                    "name": "maturity-level-description",
                    "title": "Maturity Level 2: Foundational",
                    "class": "maturity-level-foundational",
                    "parts": [
                      {
                        "name": "statement",
                        "prose": "Die Gesamtverantwortung für die Informationssicherheit ist formal der Institutionsleitung zugewiesen, z. B. in einer Geschäftsordnung. Die Leitung nimmt diese Verantwortung jedoch nur passiv wahr und delegiert die Aufgaben vollständig ohne aktive Steuerung oder Kontrolle."
                      },
                      {
                        "name": "guidance",
                        "prose": "Die Zuweisung der Verantwortung ist in einem offiziellen Dokument festgehalten. Die Leitung genehmigt Budgets, greift aber nicht proaktiv in die Gestaltung des Sicherheitsprozesses ein und informiert sich nur unregelmäßig über den Status."
                      },
                      {
                        "name": "assessment-method",
                        "prose": "Der Prüfer sichtet Dokumente wie die Geschäftsordnung, um die formale Zuweisung der Verantwortung zu verifizieren. Es wird durch Interviews geprüft, inwieweit die Leitung den Sicherheitsprozess aktiv steuert und kontrolliert."
                      }
                    ]
                  },
                  {
                    "id": "isms.1.a1-m3",
                    "name": "maturity-level-description",
                    "title": "Maturity Level 3: Defined",
                    "class": "maturity-level-defined",
                    "parts": [
                      {
                        "name": "statement",
                        "prose": "Die Institutionsleitung MUSS die Gesamtverantwortung für Informationssicherheit in der Institution übernehmen. Dies MUSS für alle Beteiligten deutlich erkennbar sein. Die Institutionsleitung MUSS den Sicherheitsprozess initiieren, steuern und kontrollieren. Die Institutionsleitung MUSS die Zuständigkeiten für Informationssicherheit festlegen und die zuständigen Mitarbeitenden mit den erforderlichen Kompetenzen und Ressourcen ausstatten. Die Institutionsleitung MUSS sich regelmäßig über den Status der Informationssicherheit sowie über mögliche Risiken und Konsequenzen aufgrund fehlender Sicherheitsmaßnahmen informieren lassen."
                      },
                      {
                        "name": "guidance",
                        "prose": "Die Übernahme der Verantwortung wird durch eine von der Leitung unterzeichnete Sicherheitsleitlinie dokumentiert. Regelmäßige Meetings (z. B. quartalsweise) zwischen der Leitung und dem ISB werden etabliert, um den Status und die Risiken zu besprechen. Die Ergebnisse dieser Meetings werden protokolliert."
                      },
                      {
                        "name": "assessment-method",
                        "prose": "Der Prüfer prüft die unterzeichnete Sicherheitsleitlinie. Es werden Protokolle der Management-Meetings zur Informationssicherheit eingesehen. Interviews mit Mitarbeitenden bestätigen, dass die Rolle der Leitung im Sicherheitsprozess klar und bekannt ist."
                      }
                    ]
                  },
                  {
                    "id": "isms.1.a1-m4",
                    "name": "maturity-level-description",
                    "title": "Maturity Level 4: Enhanced",
                    "class": "maturity-level-enhanced",
                    "parts": [
                      {
                        "name": "statement",
                        "prose": "Die Institutionsleitung lebt die Informationssicherheit aktiv vor ('Tone at the Top'). Sie hinterfragt die erhaltenen Statusberichte kritisch, fordert tiefere Analysen bei Abweichungen und verfolgt die Umsetzung von Maßnahmen zur Risikobehandlung konsequent nach. Die Einhaltung der Sicherheitspolicies wird auch auf Leitungsebene demonstriert."
                      },
                      {
                        "name": "guidance",
                        "prose": "Die Leitung nimmt aktiv an wichtigen Sensibilisierungsmaßnahmen teil. Entscheidungen zur Risikobehandlung werden nicht nur dokumentiert, sondern auch mit einer klaren Begründung für die gewählte Option (z. B. Akzeptanz, Minderung) versehen. Ein dediziertes Risikokomitee unter Vorsitz eines Mitglieds der Institutionsleitung wird eingerichtet."
                      },
                      {
                        "name": "assessment-method",
                        "prose": "Der Prüfer analysiert die Protokolle des Risikokomitees und die dokumentierten Risikoentscheidungen auf ihre Nachvollziehbarkeit. Es wird geprüft, ob die Leitung bei der Zuweisung von Ressourcen für Sicherheitsmaßnahmen eine klare Priorisierung basierend auf dem Geschäftsrisiko vornimmt."
                      }
                    ]
                  },
                  {
                    "id": "isms.1.a1-m5",
                    "name": "maturity-level-description",
                    "title": "Maturity Level 5: Comprehensive",
                    "class": "maturity-level-comprehensive",
                    "parts": [
                      {
                        "name": "statement",
                        "prose": "Die Informationssicherheitsziele sind vollständig in die übergeordneten Geschäftsziele und die strategische Planung der Institution integriert. Die Leistung im Bereich der Informationssicherheit ist Teil der Zielvereinbarungen und Leistungsbeurteilungen für das obere Management. Die Leitung fördert aktiv eine positive Sicherheitskultur und investiert proaktiv in zukünftige Sicherheitstechnologien."
                      },
                      {
                        "name": "guidance",
                        "prose": "In den jährlichen Geschäftsberichten wird über die Informationssicherheitslage berichtet. Die Zielerreichung wird anhand von Key Performance Indicators (KPIs) gemessen, die in einem Management-Dashboard visualisiert werden. Die Leitung initiiert und finanziert Forschungsprojekte zur Abwehr zukünftiger Bedrohungen."
                      },
                      {
                        "name": "assessment-method",
                        "prose": "Der Prüfer überprüft die strategischen Planungsdokumente und die Zielvereinbarungen des Managements auf die Integration von Sicherheitszielen. Es wird die Existenz und Nutzung eines KPI-Dashboards verifiziert. Die Wirksamkeit der Sicherheitskultur wird durch Mitarbeiterbefragungen und die Analyse von Sicherheitsvorfällen bewertet."
                      }
                    ]
                  }
                ]
              },
              {
                "id": "ISMS.1.A2",
                "title": "Festlegung der Sicherheitsziele und -strategie (B)",
                "class": "Management",
                "props": [
                  {
                    "name": "level",
                    "value": "1",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "phase",
                    "value": "Initiation",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "practice",
                    "value": "GOV",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_c",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_i",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_a",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  }
                ],
                "parts": [
                  {
                    "id": "isms.1.a2-m1",
                    "name": "maturity-level-description",
                    "title": "Maturity Level 1: Partial",
                    "class": "maturity-level-partial",
                    "parts": [
                      {
                        "name": "statement",
                        "prose": "Sicherheitsziele und eine Strategie sind nicht formal definiert oder dokumentiert. Sicherheitsmaßnahmen werden ad hoc und reaktiv implementiert, oft als direkte Reaktion auf Sicherheitsvorfälle oder erkannte Schwachstellen."
                      },
                      {
                        "name": "guidance",
                        "prose": "Es gibt keine übergeordnete Planung. Ein typisches Beispiel ist die Installation eines Virenscanners nach einem Malware-Befall, ohne dass eine umfassende Strategie zur Endpunktsicherheit existiert."
                      },
                      {
                        "name": "assessment-method",
                        "prose": "Der Prüfer bittet um die Vorlage von Dokumenten, die die Sicherheitsstrategie beschreiben. Werden keine Dokumente vorgelegt, wird durch Interviews mit IT-Mitarbeitern und Management geklärt, ob eine implizite, aber undokumentierte Strategie existiert."
                      }
                    ]
                  },
                  {
                    "id": "isms.1.a2-m2",
                    "name": "maturity-level-description",
                    "title": "Maturity Level 2: Foundational",
                    "class": "maturity-level-foundational",
                    "parts": [
                      {
                        "name": "statement",
                        "prose": "Allgemeine Sicherheitsziele (z. B. 'Schutz der Kundendaten') sind in der Sicherheitsleitlinie benannt. Es fehlt jedoch eine detaillierte Strategie, wie diese Ziele erreicht werden sollen, und die Ziele sind nicht messbar formuliert."
                      },
                      {
                        "name": "guidance",
                        "prose": "Die Leitlinie enthält Aussagen wie 'Wir verpflichten uns zur Vertraulichkeit'. Es gibt jedoch keine abgeleiteten Richtlinien oder Konzepte, die definieren, wie Verschlüsselung oder Zugriffskontrolle konkret umzusetzen sind, um dieses Ziel zu erreichen."
                      },
                      {
                        "name": "assessment-method",
                        "prose": "Der Prüfer analysiert die Sicherheitsleitlinie auf die Formulierung der Ziele. Es wird geprüft, ob aus den allgemeinen Zielen konkrete, messbare und terminierte Unterziele abgeleitet wurden (z. B. 'Verschlüsselung aller Laptops bis Ende Q3')."
                      }
                    ]
                  },
                  {
                    "id": "isms.1.a2-m3",
                    "name": "maturity-level-description",
                    "title": "Maturity Level 3: Defined",
                    "class": "maturity-level-defined",
                    "parts": [
                      {
                        "name": "statement",
                        "prose": "Die Institutionsleitung MUSS auf Basis der Geschäftsanforderungen und Schutzbedarfe realistische Sicherheitsziele festlegen. Die Sicherheitsziele MÜSSEN in einer Informationssicherheitsstrategie konkretisiert werden. Die Sicherheitsstrategie MUSS darlegen, wie die Sicherheitsziele langfristig erreicht werden sollen. Die Sicherheitsziele und die Sicherheitsstrategie MÜSSEN allen relevanten Mitarbeitenden bekannt gemacht werden."
                      },
                      {
                        "name": "guidance",
                        "prose": "Die Sicherheitsstrategie wird als separates, von der Leitung genehmigtes Dokument erstellt. Sie enthält einen Zeitplan für die Umsetzung wesentlicher Sicherheitsmaßnahmen und weist Verantwortlichkeiten zu. Die Strategie wird im Intranet veröffentlicht und ist Teil der Einarbeitung neuer Mitarbeiter."
                      },
                      {
                        "name": "assessment-method",
                        "prose": "Der Prüfer sichtet das Dokument der Sicherheitsstrategie und gleicht es mit den in der Leitlinie definierten Zielen ab. Es wird geprüft, ob die Strategie konkrete Meilensteine enthält. Mitarbeiterinterviews bestätigen die Kenntnis der wesentlichen strategischen Ausrichtung."
                      }
                    ]
                  },
                  {
                    "id": "isms.1.a2-m4",
                    "name": "maturity-level-description",
                    "title": "Maturity Level 4: Enhanced",
                    "class": "maturity-level-enhanced",
                    "parts": [
                      {
                        "name": "statement",
                        "prose": "Die Sicherheitsstrategie wird regelmäßig (mindestens jährlich) überprüft und an veränderte Rahmenbedingungen (z. B. neue Geschäftsprozesse, neue Bedrohungen) angepasst. Die Sicherheitsziele sind spezifisch, messbar, erreichbar, relevant und terminiert (SMART)."
                      },
                      {
                        "name": "guidance",
                        "prose": "Ein Ziel wie 'Verbesserung der Awareness' wird konkretisiert zu 'Senkung der Klickrate bei Phishing-Simulationen um 50% innerhalb von 12 Monaten'. Der Prozess zur Überprüfung der Strategie ist dokumentiert und die Ergebnisse der Überprüfung werden protokolliert."
                      },
                      {
                        "name": "assessment-method",
                        "prose": "Der Prüfer sichtet die Protokolle der Strategieüberprüfungen. Es wird die Formulierung der Sicherheitsziele anhand der SMART-Kriterien bewertet. Die Messbarkeit wird durch die Prüfung der zugrundeliegenden Metriken und KPIs verifiziert."
                      }
                    ]
                  },
                  {
                    "id": "isms.1.a2-m5",
                    "name": "maturity-level-description",
                    "title": "Maturity Level 5: Comprehensive",
                    "class": "maturity-level-comprehensive",
                    "parts": [
                      {
                        "name": "statement",
                        "prose": "Die Informationssicherheitsstrategie ist vollständig mit der IT-Strategie und der übergeordneten Unternehmensstrategie abgestimmt und integriert. Sie berücksichtigt proaktiv zukünftige technologische Entwicklungen und prognostizierte Bedrohungsszenarien. Es gibt einen formalen Prozess zur Antizipation zukünftiger Sicherheitsanforderungen."
                      },
                      {
                        "name": "guidance",
                        "prose": "Die Sicherheitsstrategie enthält einen Abschnitt zur 'Sicherheit von zukünftigen Technologien' wie KI oder Quantencomputing. Das Budget für Informationssicherheit wird auf Basis der strategischen Ziele und nicht nur auf Basis der aktuellen Risiken geplant (strategische Budgetierung)."
                      },
                      {
                        "name": "assessment-method",
                        "prose": "Der Prüfer analysiert die Protokolle von Strategiesitzungen des Managements, um die Abstimmung zwischen den verschiedenen Strategien zu verifizieren. Es wird geprüft, ob Investitionsentscheidungen für Sicherheitstechnologien mit den langfristigen strategischen Zielen begründet werden."
                      }
                    ]
                  }
                ]
              }
            ]
          }
        ]
      }
    ]
  }
}